# -*- coding: utf-8 -*-
"""
Created on Date 2022-01-16

@author: Rongjian Dai
"""

# Simulation parameters
(T, H) = (900, 90)
# 渗透率
P = 0.2
L = 300
# 信号控制参数
(minG, clt, tstep) = (10, 3, 2)
# 轨迹控制参数
(a1, a2) = (2, -8)
# 加速度折减系数
ac = 0.9
# 跟驰参数
toff = (1, 2)
doff = (5.5, 6.5)

# 交通流方向索引
move = ['0_1', '0_2', '0_3', '1_0', '1_2', '1_3', '2_0', '2_1', '2_3', '3_0', '3_1', '3_2']
# 各转向对应表 [4][3]list，4 arms, 3 turning directions: [0] - left-turn; [1] - straight-ahead; [2] - right-turn
turning = [[3, 2, 1], [0, 3, 2], [1, 0, 3], [2, 1, 0]]
# 限速
vmax = [[0, 12, 15, 13.5], [13.5, 0, 12, 15], [15, 13.5, 0, 12], [12, 15, 13.5, 0]]

# 基础交通需求
basicQ = [[0, 200, 400, 100],
          [150, 0, 150, 200],
          [380, 150, 0, 180],
          [100, 200, 100, 0]]
# 变化模式: vt[i]=0表示不变化； vt[i]=1表示arm i上左转和直行变化；vt[i]=2表示arm i上右转转和直行变化；vt[i]=3表示arm i上左转和右转变化
vt = [1, 0, 1, 0]

# 单个arm车道设置模式, [6][6][4]列表, 排列模式如图13，其中 1：EL，2：LT，3：ET，4：TR，5：ER
schemeset = [[[1, 1, 1, 4], [1, 1, 2, 4], [1, 1, 3, 4], [1, 2, 3, 4], [1, 3, 3, 4], [2, 3, 3, 4]],
            [[1, 1, 2, 5], [1, 1, 3, 5], [1, 2, 3, 5], [1, 3, 3, 5], [2, 3, 3, 5], []],
            [[1, 1, 4, 5], [1, 2, 4, 5], [1, 3, 4, 5], [2, 3, 4, 5], [], []],
            [[1, 2, 5, 5], [1, 3, 5, 5], [2, 3, 5, 5], [], [], []],
            [[1, 4, 5, 5], [2, 4, 5, 5], [], [], [], []],
            [[2, 5, 5, 5], [], [], [], [], []]]